//3.  Возьмите любую программу, которую вы писали до этого.. какая сердцу ближе. Отрефакторите ее (улучшите читабельность кода)
//    - путем разбиения крупных частей на методы поменьше. Стало лучше? (надеюсь, да)
//4.  Отрефакторите(улучшите читабельность) кода вашей реализации анализа курса валют.
//5.  Реализуйте метод, который возвращает случайную цитату Уолтера Уайта.
//6.  Реализуйте метод, который выводит explanation сегодняшнего снимка дня NASA.
//7.  Реализуйте метод, который возвращает explanation снимка дня NASA, в качестве параметра принимайте LocalDate - дату, на которую нужно брать снимок.
//8.  Реализуйте метод, который принимает два LocalDate, и сохраняет все снимки дня NASA в указанный промежуток.



public class T3_Y7_Homework_3 {
}
