//Задайте переменную. Если она больше 0, вывести «позитив», если меньше 0,вывести «отрицательно»
public class T1_Y2_Homework_2 {
    public static void main(String[] args) {
        int x = -4;
        if (x > 0) {
             System.out.println("позитив");
        }
       if (x < 0) {
           System.out.println("отрицательно");
       }
    }
}
