//4.  Создайте 10 классов - исключений. Соберите их в массив. Пусть пользователь выбирает, какое по счету исключение выбросить.
//5.  Соберите их в матрицу 3х3. Пусть пользователь выбирает номер столбца и строки, какое выбросить исключение. Если ввод неверный - выбросите десятое.
//6.  Сделайте функцию, которая возвращает случайное исключение из этих 10 (тип возвращаемого значения будет общий: Exception). Выбросите это случайное исключение.

import java.util.Scanner;

public class T4_Y6_Homework_4 {
    public static void main(String[] args) {




    }
}
